app/Controllers/Admin/Reports.php

SELECT *
FROM `users`
WHERE `users`.`id` = '488'
---
    public function clientActivities()
    {

        $userId = session()->get('user_id');
        if (is_null($userId)) {
            return view('login');
        }
        $comp = 'swclient';
        if (str_contains(base_url(uri_string()), 'eliteapp')) {
            $comp = 'eliteapp';
        }
        $user = $this->userModel->find($userId);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function plReport()
    {
        $userId = session()->get('user_id');
        if (is_null($userId)) {
            return view('login');
        }
        $comp = 'swclient';
        if (str_contains(base_url(uri_string()), 'eliteapp')) {
            $comp = 'eliteapp';
        }
        $user = $this->userModel->find($userId);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT *
FROM `users`
WHERE `role` = 'client'
ORDER BY `fullname` ASC
---
    public function brandApproval()
    {
        $userId = session()->get('user_id');
        if (is_null($userId)) {
            return view('login');
        }
        $comp = 'swclient';
        if (str_contains(base_url(uri_string()), 'eliteapp')) {
            $comp = 'eliteapp';
        }
        $user = $this->userModel->find($userId);
        $getUsers = $this->userModel->where('role', 'client')->orderBy('fullname', 'ASC')->get();