app/Controllers/Admin/Users.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function index()
    {
        $userId = session()->get('user_id');
        if (is_null($userId)) {
            return view('login');
        }
        $comp = 'swclient';
        $underComp = 1;
        if (str_contains(base_url(uri_string()), 'eliteapp')) {
            $comp = 'eliteapp';
            $underComp = 2;
        }
        $user = $this->userModel->find($userId);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function accountSetting()
    {
        $userId = session()->get('user_id');
        if (is_null($userId)) {
            return redirect()->to(base_url('/login'));
        }
        $comp = 'swclient';
        if (str_contains(base_url(uri_string()), 'eliteapp')) {
            $comp = 'eliteapp';
        }
        $user = $this->userModel->find($userId);