app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'administrator'
---
    public function loginProses()
    {
        $post = $this->request->getVar();
        $user = $this->userModel->getWhere(['username' => $post['username']])->getRow();