app/Controllers/News.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function news()
    {
        $userId = session()->get('user_id');
        if (is_null($userId)) {
            return redirect()->to(base_url('/login'));
        }
        $comp = 'swclient';
        if (str_contains(base_url(uri_string()), 'eliteapp')) {
            $comp = 'eliteapp';
        }
        $user = $this->userModel->find($userId);